; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v4 - type_1 ?v5 - type_3)
 	      (pred_2 ?v2 - object ?v5 - type_3)
	      (pred_3 ?v4 - type_1 ?v6 - type_2)
	      (pred_1 ?v4 - type_1 ?v2 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v4 - type_1 ?v7 ?v3 - type_3)
       :precondition (and  (pred_4 ?v4 ?v7))
       :effect (and  (pred_4 ?v4 ?v3)
		     (not (pred_4 ?v4 ?v7))))

   (:action op_2
       :parameters (?v4 - type_1 ?v8 - object ?v1 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v1) (pred_4 ?v4 ?v1) (pred_3 ?v4 ?v6))
       :effect (and (pred_1 ?v4 ?v8 ?v6)
		    (not (pred_2 ?v8 ?v1)) 
		    (not (pred_3 ?v4 ?v6))))

   (:action op_3
       :parameters (?v4 - type_1 ?v8 - object ?v1 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v8 ?v6) (pred_4 ?v4 ?v1))
       :effect (and (pred_2 ?v8 ?v1)
		    (pred_3 ?v4 ?v6)
		    (not (pred_1 ?v4 ?v8 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_01 obj_09 - type_1
obj_11 obj_04 obj_08 obj_10 - type_2
obj_05 obj_06 obj_12 - type_3
obj_02 obj_03 obj_07 - object)
(:init
(pred_4 obj_01 obj_06)
(pred_3 obj_01 obj_11)
(pred_3 obj_01 obj_04)
(pred_4 obj_09 obj_06)
(pred_3 obj_09 obj_08)
(pred_3 obj_09 obj_10)
(pred_2 obj_02 obj_06)
(pred_2 obj_03 obj_12)
(pred_2 obj_07 obj_12)
)
(:goal
(and
(pred_2 obj_02 obj_06)
(pred_2 obj_03 obj_05)
(pred_2 obj_07 obj_05)
)
)

(:constraints
  (always (not (pred_4 obj_01 obj_12)))
)
)

; plan
1. (op_1 obj_01 obj_06 obj_05)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_05)
   goals met: 1 of 3
2. (op_1 obj_09 obj_06 obj_12)
   deleted: (pred_4 obj_09 obj_06)
   added: (pred_4 obj_09 obj_12)
   goals met: 1 of 3
3. (op_2 obj_09 obj_07 obj_12 obj_10)
   deleted: (pred_2 obj_07 obj_12) (pred_3 obj_09 obj_10)
   added: (pred_1 obj_09 obj_07 obj_10)
   goals met: 1 of 3
4. (op_2 obj_09 obj_03 obj_12 obj_08)
   deleted: (pred_2 obj_03 obj_12) (pred_3 obj_09 obj_08)
   added: (pred_1 obj_09 obj_03 obj_08)
   goals met: 1 of 3
5. (op_1 obj_09 obj_12 obj_05)
   deleted: (pred_4 obj_09 obj_12)
   added: (pred_4 obj_09 obj_05)
   goals met: 1 of 3
6. (op_3 obj_09 obj_07 obj_05 obj_10)
   deleted: (pred_1 obj_09 obj_07 obj_10)
   added: (pred_2 obj_07 obj_05) (pred_3 obj_09 obj_10)
   goals met: 2 of 3
7. (op_3 obj_09 obj_03 obj_05 obj_08)
   deleted: (pred_1 obj_09 obj_03 obj_08)
   added: (pred_2 obj_03 obj_05) (pred_3 obj_09 obj_08)
   goals met: 3 of 3
